"""
문제
การสอบวัดความรู้ระดับพื นฐานด้าน IT หรือ IP (IT Passport Examination) มีข้อสอบ 100 ข้อ ข้อละ 1 คะแนน คิดเป็น 100% ขอบเขตเนื อหามี 3 หมวดได้แก่

Strategy (กลยุทธ์) 35%
Management (การจัดการ IT) 25%
Technology (เทคโนโลยี) 40%
เกณฑ์การสอบผ่าน ผู้เข้าสอบต้องได้คะแนนรวมไม่ตํากว่า 55% และ ต้องได้คะแนนในแต่ละหมวดไม่ตํLากว่า 30% ของคะแนนในหมวดนั น

จงเขียนโปรแกรมประเมินผลการสอบนี  

입력
บรรทัดแรก เป็นจํานวนเต็ม N ระบุจํานวนผู้สอบ และ N บรรทัด ต่อมาเป็นข้อมูลของผู้เข้าสอบแต่ละคน ข้อมูลผู้เข้าสอบแต่ละบรรทัดประกอบด้วย หมายเลขผู้สอบ(ตัวเลข 8 หลัก) แล้วตามด้วยจํานวนเต็ม 3 ค่า ซึLงเป็น คะแนนสอบในหมวดทีL 1, 2 และ 3 ตามลําดับ

출력
แต่ละบรรทัดให้พิมพ์หมายเลขผู้เข้าสอบและ ตามด้วยคะแนนรวม และผลการสอบ (PASS หรือ FAIL) ดัง รูปแบบในตัวอย่าง (ตามลําดับจากอินพุต) 
"""

for N in range(int(input())):
    applicant = list(map(int, input().split()))

    if applicant[1] < 35 * 0.3 or applicant[2] < 25 * 0.3 or applicant[3] < 40 * 0.3:
        PF = 'FAIL'
    else:
        if sum(applicant[1:]) < 55:
            PF = 'FAIL'
        else:
            PF = 'PASS'
    
    print(f"{applicant[0]} {sum(applicant[1:])} {PF}")