"""
문제
Цветин живее на поле, разделено на квадратни клетки с размер 1x1. Той много обича цветята, затова често прави нови лехи за тях. Цветните лехи имат специална форма: те са два правоъгълника, поставени един до друг, така че левите им страни образуват една права линия (фигурата вдясно).

За да украси новата леха, Цветин решил да постави по целия ѝ периметър плочки, със същия размер като клетката на полето, в което живее

Напишете програма garden, която намира броя плочки, които са необходими на Цветин.

입력
На първите четири реда на стандартния вход са записани четири цели числа w1, h1, w2 и h2 - съответно ширина и височина на първия правоъгълник, ширина и височина на втория правоъгълник, от които е направена лехата.

출력
На първия ред на стандартния изход програмата трябва да изведе едно цяло число - брой на плочките, необходими на Цветин да украси леха с дадения размер.

"""

w1 = int(input())
h1 = int(input())
w2 = int(input())
h2 = int(input())

print((max(w1, w2) + (h1 + h2)) * 2 + 4)