"""
문제
Група ученици излезли на разходка след училище. При тръгване електронният часовник на Тони показвал t1 часа и m1 минути. Те обикаляли около езеро. Когато се прибрали, Тони погледнал часовника и видял, че е t2 часа и m2 минути. Разходката продължила по-малко от едно денонощие и наймалко може да е била 0 минути. Пълна обиколка на езерото се прави точно за половин час.

и точно за половин час. Напишете програма chas, която въвежда началния и крайния час на разходката, и отпечатва времето m в минути, което е изминало и броя n на пълните обиколки, които са направили учениците за това време.

입력
От стандартния вход се въвеждат последователно четири цели числа t1, m1, t2, m2.

출력
На стандартния изход програмата трябва да изведе две цели числа m и n - търсеното време в минути и броя на пълните обиколки. Числата са разделени с един интервал.
"""

t1, m1, t2, m2 = map(int, input().split())

m = 0
if m2 - m1 < 0:
    m += m2 + 60 - m1
    t2 -= 1
else:
    m += m2 - m1
    
if t2 - t1 < 0:
    m += (t2 + 24 - t1) * 60
else:
    m += (t2 - t1) * 60

print(m, m // 30)