"""
문제
Фермер Джон прокопал прямолинейную канаву длиной 
$2 \cdot n$ метров. Затем от середины канавы прокопал под углом 
$\alpha$ к предыдущей короткую канаву длиной 
$n$ метров, после чего соединил концы канав изгородями.

Найдите величину угла между изгородями у конца короткой канавы.



입력
Первая строка содержит одно целое число 
$n$ (
$1 \le n \le 1000$). Вторая строка содержит целое число 
$\alpha$ --- величину угла между канавами в градусах (
$0 < \alpha < 180$).

출력
Выведите одно целое число --- величину угла у конца короткой канавы в градусах, округлённую до ближайшего целого числа.
"""

n = int(input())
alpha = int(input())

print(90)